{
  "char2idx": {
    " ": 1,
    "!": 2,
    "\"": 3,
    "#": 4,
    "'": 5,
    "(": 6,
    ")": 7,
    "*": 8,
    ",": 9,
    "-": 10,
    ".": 11,
    "/": 12,
    "0": 13,
    "1": 14,
    "2": 15,
    "3": 16,
    "4": 17,
    "5": 18,
    "6": 19,
    "7": 20,
    "8": 21,
    "9": 22,
    ":": 23,
    ";": 24,
    "?": 25,
    "A": 26,
    "B": 27,
    "C": 28,
    "D": 29,
    "E": 30,
    "F": 31,
    "G": 32,
    "H": 33,
    "I": 34,
    "J": 35,
    "K": 36,
    "L": 37,
    "M": 38,
    "N": 39,
    "O": 40,
    "P": 41,
    "Q": 42,
    "R": 43,
    "S": 44,
    "T": 45,
    "U": 46,
    "V": 47,
    "W": 48,
    "X": 49,
    "Y": 50,
    "Z": 51,
    "a": 52,
    "b": 53,
    "c": 54,
    "d": 55,
    "e": 56,
    "f": 57,
    "g": 58,
    "h": 59,
    "i": 60,
    "j": 61,
    "k": 62,
    "l": 63,
    "m": 64,
    "n": 65,
    "o": 66,
    "p": 67,
    "q": 68,
    "r": 69,
    "s": 70,
    "t": 71,
    "u": 72,
    "v": 73,
    "w": 74,
    "x": 75,
    "y": 76,
    "z": 77
  },
  "idx2char": {
    "0": "<BLANK>",
    "1": " ",
    "2": "!",
    "3": "\"",
    "4": "#",
    "5": "'",
    "6": "(",
    "7": ")",
    "8": "*",
    "9": ",",
    "10": "-",
    "11": ".",
    "12": "/",
    "13": "0",
    "14": "1",
    "15": "2",
    "16": "3",
    "17": "4",
    "18": "5",
    "19": "6",
    "20": "7",
    "21": "8",
    "22": "9",
    "23": ":",
    "24": ";",
    "25": "?",
    "26": "A",
    "27": "B",
    "28": "C",
    "29": "D",
    "30": "E",
    "31": "F",
    "32": "G",
    "33": "H",
    "34": "I",
    "35": "J",
    "36": "K",
    "37": "L",
    "38": "M",
    "39": "N",
    "40": "O",
    "41": "P",
    "42": "Q",
    "43": "R",
    "44": "S",
    "45": "T",
    "46": "U",
    "47": "V",
    "48": "W",
    "49": "X",
    "50": "Y",
    "51": "Z",
    "52": "a",
    "53": "b",
    "54": "c",
    "55": "d",
    "56": "e",
    "57": "f",
    "58": "g",
    "59": "h",
    "60": "i",
    "61": "j",
    "62": "k",
    "63": "l",
    "64": "m",
    "65": "n",
    "66": "o",
    "67": "p",
    "68": "q",
    "69": "r",
    "70": "s",
    "71": "t",
    "72": "u",
    "73": "v",
    "74": "w",
    "75": "x",
    "76": "y",
    "77": "z"
  }
}